print('Задание №1') # Выводит заголовок задания
a = int(input('x = ')) # Запрашивает у пользователя ввод числа и преобразует его в целое число
b = int(input('y = ')) # Запрашивает у пользователя ввод числа и преобразует его в целое число
c = int(input('z = ')) # Запрашивает у пользователя ввод числа и преобразует его в целое число
d = int(input('d = ')) # Запрашивает у пользователя ввод числа и преобразует его в целое число
e = int(input('e = ')) # Запрашивает у пользователя ввод числа и преобразует его в целое число
if a < b: a = b # Если a меньше b, то присваивает a значение b
if a < c: a = c # Если a меньше c, то присваивает a значение c
if a < d: a = d # Если a меньше d, то присваивает a значение d
if a < e: a = e # Если a меньше e, то присваивает a значение e
print('\nНаибольшее число:', a) # Выводит наибольшее число из введенных
